toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static void MSC_BOT_SendCSW(uint32_t tag, uint32_t residue, uint8_t status) {
        const CSW csw = {
            .dSignature     = 0x53425355,
            .dTag           = tag,
            .dDataResidue   = residue,
            .bStatus        = status,
        };
        
        Send(0x81, &csw, sizeof(csw));
    }
    
    static void _WaitUntilConnected() {
        T_Scheduler::Wait([] { return _State == State::Connecting || _State == State::Connected; });
        if (_State == State::Connecting) {
            // Update our state
            _State = State::Connected;
            _SetupRequest = std::nullopt;
        }
    }
    
    static void TaskEP1() {
        Toastbox::IntState ints(false);
        for (;;) {
            _WaitUntilConnected();
            
            for (;;) {
                CBW cbw;
                const std::optional<size_t> len = Recv(0x01, &cbw, sizeof(cbw));
                if (!len) break;
                Assert(*len == sizeof(CBW));
                
                Assert(cbw.dSignature == 0x43425355);
                Assert(cbw.bLUN == 0);
                Assert(cbw.bCBLength > 0);
                Assert(cbw.bCBLength < 16);
                
                SCSI_ProcessCmd(cbw.bLUN, &cbw.CB[0]);
                
                MSC_BOT_SendCSW(cbw.dTag, 0, 0);
            }
        }
    }
    
    static void TaskEP0() {
        Toastbox::IntState ints(false);
        for (;;) {
            _WaitUntilConnected();
            
            // Wait for a command
            for (;;) {
                // Wait for a new command to arrive, or for our state to change
                T_Scheduler::Wait([] { return _SetupRequest || _State!=State::Connected; });
                
                // If we're no longer connected, bail and wait to be connected again
                if (_State != State::Connected) break;
                
                // Handle the setup request
                _SetupRequestHandle(*_SetupRequest);
                
                // Consume the command
                _SetupRequest = std::nullopt;
            }
        }
    }
    
    
    
    static void CmdAccept(bool accept) {
        Toastbox::IntState ints(false);
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return;
        _CmdAccept(accept);
    }
    
    static std::optional<size_t> Recv(uint8_t ep, void* data, size_t len) {
        Assert(EndpointOut(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
        
        Assert(_Ready(eps));
        _AdvanceStateOut(ep);
        
        if (len) {
            const USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)data, len);
            Assert(us == USBD_OK);
        
        } else {
            const USBD_StatusTypeDef us = USBD_LL_PrepareReceiveZeroLen(&_Device, ep);
            Assert(us == USBD_OK);
        }
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitRecv(*T_Scheduler::template Ctx<_WaitState*>()); });
        if (!ws.ok) return std::nullopt;
        return ws.len;
    }
    
    static bool Send(uint8_t ep, const void* data, size_t len) {
        Assert(EndpointIn(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return false; // Short-circuit if we're not Connected
        
        Assert(_Ready(eps));
        _AdvanceStateIn(ep);
        
        if (len) {
            const USBD_StatusTypeDef us = USBD_LL_Transmit(&_Device, ep, (uint8_t*)data, len);
            Assert(us == USBD_OK);
        
        } else {
            const USBD_StatusTypeDef us = USBD_LL_TransmitZeroLen(&_Device, ep);
            Assert(us == USBD_OK);
        }
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitSend(*T_Scheduler::template Ctx<_WaitState*>()); });
        return ws.ok;
    }
    
    static void ISR() {
        ISR_HAL_PCD(&_PCD);
    }
    
private:
    static uint8_t _USBD_Init(uint8_t cfgidx) {
        // Open endpoints
        for (uint8_t ep : T_Config::Endpoints) {
            if (EndpointOut(ep)) {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeOut());
                _Device.ep_out[EndpointIdx(ep)].is_used = 1U;
            
            } else {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeIn());
                _Device.ep_in[EndpointIdx(ep)].is_used = 1U;
            }
            
            // Reset endpoint state
            _EndpointStateGet(ep) = {};
        }
        
        _State = State::Connecting;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DeInit(uint8_t cfgidx) {
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Suspend() {
        _State = State::Disconnected;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Resume() {
        _State = State::Connected;
        return (uint8_t)USBD_OK;
    }
    
//  USBD_StatusTypeDef ret;
//
//  USBD_ParseSetupRequest(&pdev->request, psetup);
//
//  pdev->ep0_state = USBD_EP0_SETUP;
//
//  pdev->ep0_data_len = pdev->request.wLength;
//
//  switch (pdev->request.bmRequestType & 0x1FU)
//  {
//    case USB_REQ_RECIPIENT_DEVICE:
//      ret = USBD_StdDevReq(pdev, &pdev->request);
//      break;
//
//    case USB_REQ_RECIPIENT_INTERFACE:
//      ret = USBD_StdItfReq(pdev, &pdev->request);
//      break;
//
//    case USB_REQ_RECIPIENT_ENDPOINT:
//      ret = USBD_StdEPReq(pdev, &pdev->request);
//      break;
//
//    default:
//      ret = USBD_LL_StallEP(pdev, (pdev->request.bmRequestType & 0x80U));
//      break;
//  }
//
//  return ret;
    
