toasterllc/MDCCode/Code/STM32/Shared/USB.h
        // State transitions
        switch (eps.stage) {
        case _EndpointStage::Ready:         eps.stage = _EndpointStage::Busy;          break;
        case _EndpointStage::Busy:          eps.stage = _EndpointStage::Done;          break;
        case _EndpointStage::Done:          eps.stage = _EndpointStage::Ready;         break;
        case _EndpointStage::Reset:         eps.stage = _EndpointStage::ResetZLP1;     break;
        case _EndpointStage::ResetZLP1:     eps.stage = _EndpointStage::ResetZLP2;     break;
        case _EndpointStage::ResetZLP2:     eps.stage = _EndpointStage::ResetSentinel; break;
        case _EndpointStage::ResetSentinel: eps.stage = _EndpointStage::Ready;         break;
        default:                            Assert(false);
        }
        
        // State actions
        switch (eps.stage) {
        case _EndpointStage::ResetZLP1:
        case _EndpointStage::ResetZLP2:
            USBD_LL_TransmitZeroLen(&_Device, ep);
            break;
        case _EndpointStage::ResetSentinel:
            USBD_LL_Transmit(&_Device, ep, (uint8_t*)&_ResetSentinel, sizeof(_ResetSentinel));
            break;
        default:
            break;
        }
    }
    
    static _EndpointState& _EndpointStateGet(uint8_t ep) {
        if (EndpointOut(ep)) {
            return _EndpointsOut[EndpointIdx(ep)];
        } else {
            return _EndpointsIn[EndpointIdx(ep)];
        }
    }
    
private:
    alignas(void*) // Aligned to send via USB
    static const inline uint8_t _ResetSentinel = 0;
    
    // _DevNullAddr: address that throw-away data can be written to.
    // This must be a region that a packet can be written to without causing
    // side-effects. We don't want to reserve actual RAM for this because it'd
    // just be wasted.
    // We're currently using the flash base address, so that the writes will be
    // ignored as long as the flash isn't unlocked.
    static constexpr uint32_t _DevNullAddr = 0x08000000;
    
//    alignas(void*) // Aligned to receive via USB
//    static inline uint8_t _CmdRecvBuf[MaxPacketSizeCtrl];
//    
//    static inline std::optional<size_t> _CmdRecvLen;
    
    static inline std::optional<Toastbox::USB::SetupRequest> _SetupRequest;
    
    static inline _EndpointState _EndpointsOut[1+EndpointCountOut()] = {};
    static inline _EndpointState _EndpointsIn[1+EndpointCountIn()] = {};
    static inline USBD_HandleTypeDef _Device;
    static inline PCD_HandleTypeDef _PCD;
    static inline State _State = State::Disconnected;
};
